@extends('layout.site')

@section('content')
    <h1>Интернет-магазин бытовой техники Conishua</h1>
    <p class="text-justify">
        За даними міжнародних досліджень ~44% населення України - активні інтернет-користувачі.
        30% цих людей регулярно здійснюють покупки в інтернет-магазинах, і ця частка постійно збільшується з року в рік!
        Така тенденція не викликає подиву, адже в інтернет-магазині можна довго розглядати гаджет, знайомитися з його характеристиками,
        вивчати фото- і відеоогляди і читати відгуки реальних покупців.
        При цьому докучливий продавець-консультант не буде приставати з питаннями.
        До того ж в звичайних магазинах вибір набагато менше, ніж в інтернет-магазині, та й ціни більше.
        Дешевий інтернет-магазин Conishua пропонує заощадити не тільки гроші, але і час і замовити товар, не виходячи з дому.
        Conishua - це вигідний і зручний спосіб купити новий телефон, мікрохвильовку, телевізор, планшет, смарт-годинник або інший новомодний гаджет.
    </p>

    @if($new->count())
        <h2>Новинки</h2>
        <div id="new" class="row">
            @foreach($new as $item)
                @include('catalog.part.product', ['product' => $item])
            @endforeach
        </div>
    @endif

    @if($hit->count())
        <h2>Лидеры продаж</h2>
        <div id="hit" class="row">
            @foreach($hit as $item)
                @include('catalog.part.product', ['product' => $item])
            @endforeach
        </div>
    @endif

    @if($sale->count())
        <h2>Распродажа</h2>
        <div id="sale" class="row">
            @foreach($sale as $item)
                @include('catalog.part.product', ['product' => $item])
            @endforeach
        </div>
    @endif
@endsection
